#+title: test
#+property: :tangle xmonad.hs


* show me the possibilities of orgmode
  Distrotube shows the tangle option in https://www.youtube.com/watch?v=D3FzMPZm7vY
  The associated PR is https://github.com/nvim-orgmode/orgmode/pull/435
https://github.com/nvim-orgmode/orgmode/issues/54
https://github.com/nvim-orgmode/orgmode
Global mappins
Open agenda prompt: <Leader>oa
Open capture prompt: <Leader>oc

#+NAME: test-title
#+BEGIN_SRC sh :tangle yes
echo "> title"
#+END_SRC

#+RESULTS: test-title
: > title


#+NAME: test-sh
#+BEGIN_SRC sh :tangle yes
echo "hello ape for real ?"
#+END_SRC

#+RESULTS: test-sh
: hello ape for real ?


* Use babel/run code

  Possible thanks to 'mrshmllow/orgmode-babel.nvim'. 
  Try running the "<Range>OrgExecute", "<Range>OrgTangle" commands

  https://orgmode.org/manual/Extracting-Source-Code.html

